Revit 2026 API

# ExportIFCCategoryInfoIsDefault Method

---

Determines if a ExportIFCCategoryInfo contains default information.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsDefault()
```
```vb
Public Function IsDefault As Boolean
```
```cpp
public:
bool IsDefault()
```
```fsharp
member IsDefault : unit -> bool
```

#### Return Value

Boolean True if the ExportIFCCategoryInfo contains only default information.

We consider an ExportIFCCategoryInfo is set to default if it is set to export and has no entity name.

#### Reference

ExportIFCCategoryInfo Class

Autodesk.Revit.DB Namespace